[M_Orchid_BuryingThePast MissionDefinition]
MissionDescription="Aubrey Callahan III is the great-granddaughter of a vicious pirate queen. As one might imagine, such a fact might put a crimp in one's reputation and job prospects. For this reason, Aubrey has hired you to destroy her great-grandma's old pirate ship, the Kronus, subsequently destroying all evidence of her gram's murderous existence."
TurnInDescription="With her great-grandma erased from history, Aubrey can now attempt to live a normal life, free of child-schmafficking."
MissionSummary="Scuttle the Kronus."

[M_Orchid_BuryingThePast:DestroyShip MissionObjectiveDefinition]
ProgressMessage="Blow the Kronus to hell"
